[
  {
    "Id": "898022",
    "ThreadId": "390992",
    "Html": "\r\n<p><span style=\"font-size:10pt\">Hi,</span></p>\r\n<p><span style=\"font-size:10pt\">We are facing a problem with TreeViewEx control.</span></p>\r\n<p><span style=\"font-size:10pt\">In our application, we are binding an ObservableCollection with TreeViewEx ItemSource . Observable collection is collection of objects of our class which is having some properties binded to TreeViewExItem properties.Every item\r\n in observable collection is a TreeViewExItem.</span></p>\r\n<p><span style=\"font-size:10pt\">Now process goes in this way:- when we click on the root element of treeview control.We add the children of this in Observable collection.Code sample for this is as shown below:-</span></p>\r\n<p><span style=\"color:blue; font-size:10pt\">foreach</span><span style=\"font-size:10pt\"> (<span style=\"color:blue\">var</span> childEntityNode\r\n<span style=\"color:blue\">in</span> orderedChildEntityNodes)</span></p>\r\n<p><span style=\"font-size:10pt\">{</span></p>\r\n<p><span style=\"font-size:10pt\">&nbsp;&nbsp;&nbsp;&nbsp; observableHierarchy.Children.Add(childEntityNode);</span></p>\r\n<p><span style=\"font-size:10pt\">}</span></p>\r\n<p><span style=\"font-size:10pt\">&nbsp;</span></p>\r\n<p><span style=\"font-size:10pt\"><strong>After this, we do other operation also &amp; set some property of child nodes. When all the operation gets complete then it fires the treeViewEx control&rsquo;s OnInitialize process for each child, while it is expected\r\n to fire at once on the time of adding children in ObservableHierarchy</strong>.</span></p>\r\n<p><span style=\"font-size:10pt\">Because of this , <strong>the property binding of our class with treeviewEx control doesn&rsquo;t work properly</strong>.</span></p>\r\n<p><span style=\"font-size:10pt\">In other scenario when we add all the children&rsquo;s &amp; do not set any property at that time. After when the initialization of all children is done&nbsp;, we set property of that nodes then&nbsp;In that case all bindings\r\n with control works fine.</span></p>\r\n<p><span style=\"font-size:10pt\">Can you please , Help out in this.</span></p>\r\n",
    "PostedDate": "2012-08-10T05:45:09.16-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "898330",
    "ThreadId": "390992",
    "Html": "<p>Hi,</p>\r\n<div>so probably your problem occures because someone reinitializes the  properties. I dont know who or when. Maybe it is done in the initialization routines of  the base classes. I&rsquo;m not sure.</div>\r\n<div></div>\r\n<div>But in order to help you best, I have to ask why you do it that way? The  normal way would be to bind a Observable collection of viewmodels to the  ItemsSource. Thy would have to implement INotifyPropertyChanged and apply a  DataTemplate to make them look like you want. If you would do so, the  TreeViewExItems would be initalized by the TreeViewEx and you would not have any  of the problems you described.</div>\r\n<div></div>\r\n<div>If you can not go the way I suggested, you might provide some sample  application, so I can debug the problem.</div>\r\n<div></div>\r\n<div>Regards</div>",
    "PostedDate": "2012-08-11T04:02:41.6-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "900370",
    "ThreadId": "390992",
    "Html": "\r\n<div>Hi,</div>\r\n<div></div>\r\n<div>Thanks for ur concern. I am looking into this. As soon as i get the root cause of this problem i will inform u. Else i will send u the sample application.</div>\r\n<div></div>\r\n<div>Thanks</div>\r\n<div>Saurabh Jain<br>\r\n<br>\r\n</div>\r\n<div>On 17 August 2012 03:55, slompf <span dir=\"ltr\">&lt;<a href=\"mailto:notifications@codeplex.com\" target=\"_blank\">notifications@codeplex.com</a>&gt;</span> wrote:<br>\r\n<blockquote style=\"border-left:#ccc 1px solid; margin:0px 0px 0px 0.8ex; padding-left:1ex\">\r\n<div>\r\n<p>From: slompf</p>\r\n<div>\r\n<p>Hi,</p>\r\n<div>so probably your problem occures because someone reinitializes the properties. I dont know who or when. Maybe it is done in the initialization routines of the base classes. I’m not sure.</div>\r\n<div></div>\r\n<div>But in order to help you best, I have to ask why you do it that way? The normal way would be to bind a Observable collection of viewmodels to the ItemsSource. Thy would have to implement INotifyPropertyChanged and apply a DataTemplate to make them look\r\n like you want. If you would do so, the TreeViewExItems would be initalized by the TreeViewEx and you would not have any of the problems you described.</div>\r\n<div></div>\r\n<div>If you can not go the way I suggested, you might provide some sample application, so I can debug the problem.</div>\r\n<div></div>\r\n<div>Regards</div>\r\n</div>\r\n<div>\r\n<p>Read the <a href=\"http://treeviewex.codeplex.com/discussions/390992#post898330\" target=\"_blank\">\r\nfull discussion online</a>.</p>\r\n<p>To add a post to this discussion, reply to this email (<a href=\"mailto:treeviewex@discussions.codeplex.com?subject=[treeviewex:390992]\" target=\"_blank\">treeviewex@discussions.codeplex.com</a>)</p>\r\n<p>To start a new discussion for this project, email <a href=\"mailto:treeviewex@discussions.codeplex.com\" target=\"_blank\">\r\ntreeviewex@discussions.codeplex.com</a></p>\r\n<p>You are receiving this email because you subscribed to this discussion on CodePlex. You can\r\n<a href=\"https://treeviewex.codeplex.com/discussions/390992/unsubscribe/\" target=\"_blank\">\r\nunsubscribe</a> on CodePlex.com.</p>\r\n<p>Please note: Images and attachments will be removed from emails. Any posts to this discussion will also be available online at CodePlex.com</p>\r\n</div>\r\n</div>\r\n</blockquote>\r\n</div>\r\n<br>\r\n<br clear=\"all\">\r\n<br>\r\n-- <br>\r\n<div>With Regards:-</div>\r\n<div><em><font color=\"#6600cc\" face=\"arial,helvetica,sans-serif\">Saurabh Jain</font></em></div>\r\n<div>GE Energy, Mumbai</div>\r\n<br>\r\n",
    "PostedDate": "2012-08-16T22:39:48.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "912991",
    "ThreadId": "390992",
    "Html": "<p>Saurabh,</p>\r\n<p>the Initialized event of FrameworkElements is fired when the element has been fully initialized by the framework, which happens after it has been added to the UI, IIRC. Since you are adding your child controls (and no data items!) directly to that collection, they are only later added to the actual control in your window and then (asynchronously) initialised. That is after your method that adds the controls and sets some properties on them completes.</p>\r\n<p>I really think that you shouldn't use the TreeViewExItem directly in the Children collection. That collection is meant to hold data items and the TreeViewEx control creates a TreeViewExItem for each of them itself. (At least this is the only way I've learned to use a TreeView in WPF, I don't know anything else about this other than it must be complicated as hell...)</p>\r\n<p>This is the article that teached things to me: http://www.codeproject.com/Articles/26288/Simplifying-the-WPF-TreeView-by-Using-the-ViewMode</p>",
    "PostedDate": "2012-09-15T02:03:43.953-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]