[
  {
    "Id": "1071068",
    "ThreadId": "450751",
    "Html": "Hello,\r<br />\n<br />\nI'm using the TreeViewEx control in my project for several tools. Most of them require multi-selection so this is perfect for me. However, one of them must disallow multi-selection and I think there is no way to disable it.\r<br />\n<br />\nIt would be very handy to be able to disable it, so I can still use this control in this particular case and benefit its other advantage.<br />\n",
    "PostedDate": "2013-07-21T20:08:43.32-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1071090",
    "ThreadId": "450751",
    "Html": "Try the onselection event of the treeview control. There you can cancel selection.<br />\n",
    "PostedDate": "2013-07-21T22:46:36.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1071101",
    "ThreadId": "450751",
    "Html": "Oh, that works pretty well, thank you :)\r<br />\n<br />\nHowever, I can still draw the selection rectangle, it could be nice to be able to disable it as well.<br />\n",
    "PostedDate": "2013-07-21T23:35:10.073-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1071445",
    "ThreadId": "450751",
    "Html": "I see. The OnSelection event was meant to decide for some items, if they are allowed to be selected. You want to disable selection completely. I will have to implement that.<br />\n",
    "PostedDate": "2013-07-22T11:52:27.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1071580",
    "ThreadId": "450751",
    "Html": "I still want to have single item selection by simple clicking. I saw in the source that there is a SelectionMultiple class which is currently the one used, and a stub of an unimplemented SelectionSingle class. That would be a good solution, having a bool to enable/disable multi selection by switching the InputSubscriber to use.<br />\n",
    "PostedDate": "2013-07-22T19:49:47.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1073397",
    "ThreadId": "450751",
    "Html": "Hi,\r<br />\n<br />\ndoing that was the plan, but this feature was not requested until now. Maybe you want to implement the single selection strategy? My first goal is to refactor the multiselection strategy.<br />\n",
    "PostedDate": "2013-07-26T03:23:03.053-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1074179",
    "ThreadId": "450751",
    "Html": "Yep, I can do that, but it's a low priority for me now.\r<br />\nI will probably give a try in a few weeks when I'm done with the main features of my tools.<br />\n",
    "PostedDate": "2013-07-28T22:22:49.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1106810",
    "ThreadId": "450751",
    "Html": "Also, visual studio solution explorer style selection would be great. You can do multiselection by shift and ctrl keys, but not with mouse alone (no selection rectangle).<br />\n",
    "PostedDate": "2013-10-12T23:22:44.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]